app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "171"]]
UPDATE "users" SET "name" = $1, "email" = $2, "password_digest" = $3, "updated_at" = $4 WHERE "users"."id" = 211  [["name", "New Name"], ["email", "new@example.com"], ["password_digest", "$2a$04$bW8SI.5gS8mCuhXucHRcO.R0RjqCfm1VT4/CFNb0dOLrWm//0J8d6"], ["updated_at", Tue, 08 Apr 2014 06:48:09 UTC +00:00]]